Repository: WikiToLearn/Translations
Catalog: locales/*/wikitolearn-guide-chapter-5.po
Languages: ca, de, it

source: VisualEditor is the main tool you can use to create and edit pages on WikiToLearn. Using VisualEditor is very easy! If you already have some experience in any kind of text editing software you will have no problem in understanding how VisualEditor works.
ca: L'editor visual és l'eina principal que podeu utilitzar per crear i editar pàgines al WikiToLearn. L'ús de l'editor visual és molt fàcil! Si ja teniu alguna experiència en qualsevol tipus de programari per a l'edició de text, no tindreu cap problema en entendre com funciona.
de: Mit dem VisualEditor kannst du Seiten auf WikiToLearn erstellen und bearbeiten. Die Benutzung ist sehr einfach. Wenn du dich bereits mit Textbearbeitungssoftware auskennst, wird dir der VisualEditor keine Probleme bereiten.
it: VisualEditor è lo strumento utilizzato principalmente per creare e per modificare le pagine su WikiToLearn. Usarlo è molto semplice! Non sarà difficile comprenderne il funzionamento se possiedi già un minimo di esperienza con un qualsiasi altro software di videoscrittura.

source: Basic Usage
ca: Ús bàsic
de: Grundlegende Benutzung
it: Utilizzo di base

source: Activating VisualEditor
ca: Activació de l'editor visual
de: Den VisualEditor aktivieren
it: Attivare VisualEditor

source: If you want to edit an existing page, just press the <code>Edit</code> button at the top of the page and watch VisualEditor load: after a few seconds it should be ready to use.
ca: Si voleu editar una pàgina existent, només heu de prémer el botó <code>Edita</code> que hi ha a la part superior de la pàgina i veureu com es carrega l'editor visual: al cap d'uns segons hauria d'estar llest per al seu ús.
de: Um eine bestehende Seite zu bearbeiten, klicke die Schaltfläche <code>Bearbeiten</code>. Der VisualEditor sollte innerhalb weniger Sekunden geladen sein.
it: Se desideri modificare una pagina già esistente premi semplicemente il pulsante <code>Modifica</code> in alto nella pagina, e aspetta il caricamento di VisualEditor: dopo alcuni secondi dovrebbe essere pronto all'uso.

source: Editing
ca: Edició
de: Bearbeitung
it: Modifica

source: VisualEditor has more or less the same features and functions of any other word processor software, like bold, italics, ordered lists and so on.
ca: L'editor visual té més o menys les mateixes característiques i funcions de qualsevol altre programari processador de textos, com negreta, cursiva, llistes ordenades i així successivament.
de: Der VisualEditor funktioniert wie ähnliche Textbearbeitungssoftware. Der Text lässt sich einfach fett, kursiv, unterstrichen, usw. formatieren.
it: VisualEditor ha all'incirca le stesse caratteristiche e funzioni di un qualsiasi elaboratore di testi, come grassetto, corsivo, elenchi ordinati e così via.

source: Advanced editing
ca: Edició avançada
de: Erweitertes Bearbeiten
it: Modifica avanzata

source: Insert media
ca: Inserir un suport
de: Medien einfügen
it: Inserire un elemento multimediale

source: To insert media in the text, just click the <code>Insert</code> option in the VisualEditor toolbar and select <code>Media</code>: you can either upload new files using the <code>Upload</code> tab or <code>Search</code> for existing media both on WikiToLearn or Wikimedia Commons.
ca: Per inserir suports en el text, feu clic a l'opció <code>Insereix</code> a la barra d'eines de l'editor visual i seleccioneu </code>Suport</code>: podeu pujar fitxers nous utilitzant la pestanya <code>Puja</code> o <code>Cerca</code> per als suports existents tant al WikiToLearn o al Wikimedia Commons.
de: Um Medien in den Text einzufügen, klicke auf <code>Einfügen</code> in der Menüleiste und wähle <code>Medien</code>. Auf diese Art kannst du sowohl neue Dateien mit Hilfe des <code>Upload</code> -Reiters hochladen, als auch WikiToLearn und Wikimedia Commons nach Medien durchsuchen (<code>Search</code>)
it: Per inserire degli elemento multimediali nel testo seleziona l'opzione <code>Inserisci</code> nella barra degli strumenti di VisualEditor, e fai clic su <code>File Multimediali</code>: è possibile sia caricare dei nuovi file usando la scheda <code>Carica</code>, sia cercare con <code>Cerca</code> dei file già esistenti su WikiToLearn o su Wikimedia Commons.

source: Insert formulas
ca: Inserir fórmules
de: Formeln einfügen
it: Inserire formule

source: To insert mathematical formulas in the text, just click the <code>Insert</code> option in the VisualEditor toolbar and select <code>Formula</code>: this will open up the Formula Editor window which will allow you to write math formulas easily.
ca: Per inserir fórmules matemàtiques en el text, només feu clic a l'opció <code>Insereix</code> que hi ha a la barra d'eines de l'editor visual i seleccioneu <code>Fórmula</code>: això obrirà la finestra de l'editor de fórmules que us permetrà escriure fórmules matemàtiques amb facilitat.
de: Um mathematische Formeln einfach mithilfe des Formel-Editors einzufügen, klicke auf die Schaltfläche <code>Einfügen</code> in der Menüleiste des VisualEditor und klicke <code>Formel</code>.
it: Per inserire delle formule matematiche nel testo è sufficiente fare clic sull'opzione <code>Inserisci</code> nella barra degli strumenti di VisualEditor e selezionare <code>Formula</code>: questo farà aprire la finestra dell'editor delle formule, che ti permetterà di scrivere semplicemente le formule matematiche.

source: Insert templates
ca: Inserir plantilles
de: Vorlagen einfügen
it: Inserire i templates

source: Templates are used to add recurring messages to pages in a consistent way. They are often used in mathematics sections when you want to write a definition, theorem, lemma, corollary etc. They can be inserted within any section of the course.
ca: Les plantilles s'utilitzen per a publicar missatges recurrents a les pàgines d'una manera consistent. Sovint s'utilitzen en les seccions de matemàtiques quan es vol escriure una definició, teorema, lema, corol·lari, etc. Poden inserir-se dins de qualsevol secció del curs.
de: Mit Vorlagen lassen sich häufig wiederkehrende Elemente auf Seiten hinzufügen. Oft werden sie für das Schreiben mathematischer Definitionen, Theoreme, Lemmata, Folgerungen usw. verwendet. Sie können innerhalb jedes Abschnitts in einem Kurs eingefügt werden.
it: I templates sono utilizzati per aggiungere in modo coerente dei messaggi ricorrenti alle pagine. Sono spesso usati nelle sezioni matematiche per scrivere definizioni, teoremi, lemmi, corollari, ecc. Possono ovviamente essere inseriti in ogni sezione.

source: Official Guide
ca: Guia oficial
de: Offizielles Handbuch
it: Guida Ufficiale
