Repository: WikiToLearn/Translations
Catalog: locales/*/wikitolearn-guide-chapter-2.po
Languages: ca, de, it

source: Course is a collection of pages with a well defined tree structure. Every course on WikiToLearn has a unique name. You can create a private course under your namespace or a public/collaborative course where everyone can contribute.
de: Ein Kurs ist eine Sammlung von Seiten, die klar hierarchisch gegliedert sind. Jeder Kurs auf WikiToLearn hat einen spezifischen Namen. Du kannst entweder private Kurse in deinem Benutzer-Namensraum, oder öffentliche Kurse, an denen jeder mitarbeiten kann, erstellen.
it: Un corso è una raccolta di pagine con una struttura ad albero ben definita. Ogni corso ha un nome univoco in WikiToLearn. Puoi creare un corso privato nel tuo namespace, oppure uno pubblico o collaborativo in cui ognuno possa contribuire.

source: Create a course
ca: Crear un curs
de: Einen Kurs erstellen
it: Creare un corso

source: The first thing to do to create a course is going to the right department and the right topic. For example, if you are writing a <code>Quantum Physics</code> course, you need to go to the physics department located at http://en.wikitolearn.org/Physics. Find the most appropriate topic and click on it. In the previous example, you should look for a topic named "Quantum Physics" or "Quantum Mechanics".
it: La prima cosa da fare per creare un corso è quella di andare nel dipartimento e nell'argomento appropriati. Per esempio, se ne stai scrivendo uno di <code>fisica quantistica</code> devi andare nel dipartimento che trovi in https://it.wikitolearn.org/Fisica. Trova l'argomento più appropriato, quindi facci clic sopra. Nell'esempio precedente avresti dovuto cercare un argomento chiamato "fisica quantistica" oppure "meccanica quantistica".

source: Click the "Create Course" button: a form will show up.
ca: Feu clic al botó «Crea un curs»: es mostrarà un formulari.
de: Klicke jetzt "Kurs erstellen". Es öffnet sich ein ausfüllbares Formular.
it: Fai clic sul pulsante "Crea il corso": comparirà un modulo.

source: '''Note:''' if there isn't an appropriate topic for the course, you can create one by clicking the "Create Course and Topic" button on the department page. The name of the topic will be the same as the name of the course.
ca: '''Nota:''' si no és un tema apropiat per al curs, podeu crear-ne un fent clic al botó «Crea un curs i tema» a la pàgina del departament. El nom del tema serà el mateix que el nom del curs.
de: '''Hinweis:''' Falls es kein passendes Themengebiet für deinen Kurs gibt, kannst du durch die Schaltfläche "Kurs und Themengebiet erstellen" auf der Seite des Fachbereichs ein neues erstellen. Der Name des Kurses wird dann auch zum Namen des Themengebiets.
it: '''Nota:''' se non c'è un argomento appropriato per il corso, lo puoi creare: fai clic sul pulsante "Crea il corso e l'argomento" nella pagina del dipartimento. Il nome dell'argomento sarà lo stesso di quello del corso.

source: You can choose to make the course public or private. A public course is located under the related department, while a private course is located under the user namespace.
ca: Podeu optar per fer el curs públic o privat. Un curs públic s'ubica sota el departament relacionat, mentre que un curs privat s'ubica sota l'espai de nom de l'usuari.
de: Jetzt kannst du auswählen, ob du den Kurs öffentlich oder privat machen willst. Ein öffentlicher Kurs wird in dem passenden Fachbereich einsortiert, während private Kurse in deinem Benutzer-Namensraum zu finden sind.
it: Puoi scegliere se fare un corso pubblico oppure privato. Un corso pubblico si trova nel dipartimento relativo, mentre uno privato nel namespace utente.

source: It is strongly recommended to create a private course and publish it once completed. However, if you decide to create a public course, it will be displayed under the <code>Department/Topic</code> url and everyone can modify it by creating, moving and deleting content.
ca: És altament recomanable crear un curs privat i public una vegada completat. No obstant això, si decidiu crear un curs públic, que es mostrarà sota l'URL <code>Departament/Tema</code> i tothom podrà modificar-lo tot creant, movent i eliminant el contingut.
de: Wir empfehlen, zuerst einen privaten Kurs zu erstellen, und ihn öffentlich zu machen, wenn er fertiggestellt ist. Wenn du dich trotzdem entscheidest, einen öffentlichen Kurs zu erstellen, wird er unter der <code>Fachbereich/Thema</code> angezeigt und jeder kann den Kurs bearbeiten, Inhalte erstellen, verschieben und löschen.
it: Si raccomanda caldamente di creare un corso privato e di pubblicarlo solo dopo averlo completato. Tuttavia, se decidi di creare un corso pubblico, questo sarà visualizzato nell'url <code>Dipartimento/Argomento</code>: chiunque potrà modificarlo aggiungendo, spostando o rimuovendo del contenuto.

source: Course Metadata
ca: Metadades del curs
de: Kurs-Metadaten
it: Metadati del corso

source: It is possible to add additional information to a course. This is helpful when you have some external links or PDF with exercises, notes or bibliography that you want to attach to the course.
ca: És possible afegir informació addicional a un curs. Això és útil quan es tenen alguns enllaços externs o PDF amb exercicis, notes o bibliografia que voleu adjuntar al curs.
de: Es ist möglich, zusätzliche Informationen zu einem Kurs anzugeben. Das ist dann hilfreich, wenn du zum Beispiel externe Links, PDFs mit Übungen, Notizen oder eine Literaturliste an den Kurs anhängen möchtest.
it: È possibile aggiungere delle informazioni addizionali ad un corso. Questo è utile se hai dei collegamenti esterni, o dei file PDF con esercizi, appunti o bibliografia che vuoi unire al corso.

source: To add metadata visit the course root page and click on the "Edit metadata" button. Then you can add the additional information in the respective input fields. In particular, you can add information about:
ca: Per afegir les metadades, visiteu la pàgina arrel del curs i feu clic al botó «Edita les metadades». A continuació, podreu afegir la informació addicional en els camps d'entrada respectius. En particular, podeu afegir informació sobre:
de: Um Metadaten zum Kurs hinzufügen, gehe auf die Hauptseite des Kurses und klicke auf "Metadaten bearbeiten". Dann kannst du zusätzliche Informationen in die entsprechenden Felder eingeben. Du kannst hier vor allem folgende Informationen einfügen:
it: Per aggiungere dei metadati visita la pagina principale del corso, e fai clic sul pulsante "Modifica i metadati". Puoi quindi aggiungere le informazioni aggiuntive nei rispettivi campi di immissione. In particolare puoi aggiungere delle informazioni riguardo a:

source: Bibliography
ca: Bibliografia
de: Literaturverzeichnis
it: La bibliografia

source: Exercises
ca: Exercicis
de: Übungen
it: Gli esercizi

source: Books
ca: Llibres
de: Bücher
it: I libri

source: External References
ca: Referències externes
de: Externe Referenzen
it: I riferimenti esterni

source: Publish a course
ca: Publicar un curs
de: Einen Kurs veröffentlichen
it: Pubblicare un corso

source: If you created a private course, it will stay under your user namespace unless you decide to publish it. To publish a private course, navigate to the course main page and click on the "Publish Course" button. A WikiToLearn's admin will take into account the request and will move the content to the public topic page.
ca: Si heu creat un curs privat, aquest romandrà sota l'espai de nom de l'usuari llevat que decidiu publicar-lo. Per a publicar un curs privat, aneu a la pàgina principal del curs i feu clic al botó «Publica el curs». Un administrador de WikiToLearn tindrà en compte la sol·licitud i mourà el contingut a la pàgina pública del tema.
de: Wenn du einen privaten Kurs erstellt hast, wird er in deinem Benutzer-Namensraum verbleiben, bis du dich entscheidest, ihn zu veröffentlichen. Um einen Kurs zu veröffentlichen, gehe auf die Hauptseite eines privaten Kurses und klicke auf "Kurs veröffentlichen". Ein Admin von WikiToLearn wird sich den Veröffentlichungsantrag ansehen und den Inhalt veröffentlichen.
it: Se hai creato un corso privato questo rimarrà nel tuo namespace utente, a meno che tu non decida di pubblicarlo. Per pubblicare un corso privato spostati nella pagina principale del corso, e fai clic sul pulsante "Pubblica il corso". Un amministratore di WikiToLearn prenderà in considerazione la richiesta, e sposterà il contenuto in una pagina pubblica.
